// 高阶函数的概念： 1、一个函数的参数是一个函数，我们可以称之为这个函数为高阶函数 （函数的参数为函数）
//                 2. 一个函数返回一个函数我们也称之为高阶函数 (函数返回函数) 
function eat(...args) {
    console.log('吃饭', args)
}

// 在开发的过程中我们不希望破坏（更改）原有的函数，要对这个函数进行扩展
// 我们希望对函数进行扩展 

Function.prototype.before = function(beforeFn) {
    // 谁调用方法this就指向谁
    return (...args) => { // newFn 获取函数中的所有参数
        // 箭头函数中没有this，那么会向上查找
        beforeFn(); // 扩展函数
        this(...args)
    }
}
let newFn = eat.before(() => { // before接受了一个函数 作为参数，那么before函数就是一个高阶函数
    console.log('刷牙')
})
newFn('火腿肠');

// 函数执行的时候产生的执行上下文，代码在定义的时候就确定了作用域！
// 这里真产生了闭包吗？  什么叫闭包：开发中的理解：函数定义的作用域和执行的作用域不是同一个就会产生闭包

// 》 以后再扩展代码的时候 尽量不直接更改原来的函数，采用高阶函数进行包裹，在内部进行扩展